CSI API ETABS v1

# cCaseDirectHistoryNonlinear Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cCaseDirectHistoryNonlinear

    Public Interface cCaseDirectHistoryNonlinear

    Dim instance As cCaseDirectHistoryNonlinear

    public interface class cCaseDirectHistoryNonlinear

    type cCaseDirectHistoryNonlinear =  interface end

The cCaseDirectHistoryNonlinear type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetLoads|  Retrieves the load data
for the specified load case
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com